import { ReactNode } from 'react';

export type ShowcaseContentType = {
   title: string;
   date: string;
   thumbnailSrc: string;
   videoSrc: string;
   imgSrc: string[];
   detail: ReactNode;
};

export const showcaseList: ShowcaseContentType[] = [
   {
      title: '📌 V1SE WIFI เครื่องเขียนค่าแบต-ค่าจอที่ช่างซ่อมมือถือห้ามพลาด!',
      date: '2025-03-18',
      thumbnailSrc:
         'https://1drv.ms/i/c/799d5915db97c270/IQR3mtul5PMRRr4u3bn2UAOlAXpXj7aHPpmrods28nzyptk?width=1024',
      videoSrc:
         'https://1drv.ms/v/c/799d5915db97c270/IQRBZw23D0ZZQoeYlUtGbFdZAUuWA2cpYPY6zj0DXdMl3Ws',
      imgSrc: [
      ],
      detail: (
         <>
            📌 V1SE WIFI เครื่องเขียนค่าแบต-ค่าจอที่ช่างซ่อมมือถือห้ามพลาด!
            <br />
            <br />
            ✨ ฟังก์ชันครบในเครื่องเดียว
            <br />
            ✅ เขียนค่าแบตเตอรี่ ให้แม่นยำ ปรับค่าได้ง่าย
            <br />
            ✅ เขียนค่าหน้าจอ แก้ไขปัญหาที่เจอประจำ
            <br />
            ✅ รองรับการเขียนค่า Face ID, กล้อง, Ridar และอีกมากมาย
            <br />
            ✅ ใช้งานสะดวก เชื่อมต่อง่าย
            <br />
            <br />
            🔧 ใครต้องมี?
            <br />
            ช่างซ่อมมือถือที่ต้องเขียนค่าแบตหรือจอบ่อยๆ
            ร้านซ่อมที่ต้องการความเร็วและความแม่นยำในงานซ่อม
            <br />
            🛠️ อาจารย์ทิเบตบอกเลยว่า ถ้าคุณทำงานซ่อม ต้องมีติดโต๊ะไว้
            เพราะช่วยให้งานเร็วขึ้น เพิ่มประสิทธิภาพให้ร้านของคุณ!
            <br />
            <br />
            💬 สนใจสั่งซื้อ หรืออยากรู้รายละเอียดเพิ่มเติม คอมเมนต์ไว้เลย
            เดี๋ยวทีมงานตอบให้ค่ะ!
            <br />
            ☎️: 096-593-6661 (K.แจง)
            <br />
            🔋: Line ID: 0965936661
            <br />
            📧: trainingcenter@endu.co.th
         </>
      ),
   },
   {
      title: '🔥 พัดลมระบายความร้อนเมนบอร์ด พร้อมไฟ UV 🔥',
      date: '2025-03-18',
      thumbnailSrc:
         'https://1drv.ms/i/c/799d5915db97c270/IQSY9lLsh_0sSr5SeKi90YCoAYK_NifwNBSv4yujNoHeqEM?width=1024',
      videoSrc:
         'https://1drv.ms/v/c/799d5915db97c270/IQS_BzQYWYcDQJdxH0uLr1mPAZUuQWKipk9Rgdub2ShXt-Y',
      imgSrc: [],
      detail: (
         <>
            🔥 พัดลมระบายความร้อนเมนบอร์ด พร้อมไฟ UV 🔥
            <br />
            <br />
            🛠️ เครื่องมือที่ช่างต้องมี! รวม 3 ฟังก์ชันในเครื่องเดียว
            <br />
            ✅ ระบายความร้อน เมนบอร์ด ชิป CPU เร็วทันใจ
            <br />
            ✅ อบ UV Curing ซ่อมแซมชิป SMD/BGA ได้มีประสิทธิภาพ
            <br />
            ✅ ดูดควัน ลดควันจากงานซ่อม ปลอดภัยต่อสุขภาพ
            <br />
            <br />
            ⚡ ปรับความเร็วได้ 3 ระดับ พัดลมทรงพลัง 10,000 รอบ/นาที
            <br />
            🔋 ใช้งานไร้สาย ชาร์จผ่าน USB Type-C
            <br />
            💡 ขนาดกะทัดรัด พกพาสะดวก ใช้งานง่าย
            <br />
            <br />
            🔧 เหมาะสำหรับ: ช่างซ่อมมือถือ-เมนบอร์ด
            ที่ต้องการเครื่องมือครบจบในตัวเดียว!
            <br />
            <br />
            สั่งซื้อสินค้าได้ที่
            <br />
            ☎️: 096-593-6661 (K.แจง)
            <br />
            🔋 Line ID: 0965936661
            <br />
            📧: trainingcenter@endu.co.th
         </>
      ),
   },
   {
    title: '🔧 เจาะลึก! การเขียนค่าแบตเตอรี่ให้ไม่แจ้งเตือน 🔋✨',
    date: '2025-03-18',
    thumbnailSrc:
       'https://1drv.ms/i/c/799d5915db97c270/IQT0KUEoYaESQaMpIeWJaxycAbfH7Fd1H7t1ym-r2wvXs68?width=1024',
    videoSrc:
       'https://1drv.ms/v/c/799d5915db97c270/IQRWM4l9uUBMRK_P1_L9DeIZAdzfuAwNghYxQpsOreW5NpI',
    imgSrc: [
    ],
    detail: (
       <>
          🔧 เจาะลึก! การเขียนค่าแบตเตอรี่ให้ไม่แจ้งเตือน 🔋✨
          <br />
          <br />
          วันนี้อาจารย์ทิเบตมาสอนเทคนิคการเขียนค่าแบตฯ อย่างละเอียด พร้อมแนะนำโปรแกรมและอุปกรณ์ที่ใช้ 📌 พร้อมแนะนำเทคนิคต่างๆอีกมากมาย!
          <br />
          <br />
          📌 ใครที่อยากเรียนรู้เทคนิคซ่อมมือถือระดับมืออาชีพ
          <br />
          📌 อยากเข้าใจการเขียนค่าแบตฯ แบบถูกต้องและใช้งานได้จริง
          <br />
          <br />
          สามารถติดต่อมาได้เลย 📲 โอกาสดีๆ รออยู่!
          <br />
          ☎️: 096-593-6661 (K.แจง)
          <br />
          🔋 Line ID: 0965936661
          <br />
          📧: trainingcenter@endu.co.th
       </>
    ),
 },
];
